package com.example.kexamplerecycleview.model

import com.example.kexamplerecycleview.model.entity.Note

object NotesRepSecond {
    private val notes: List<Note> = listOf(
        Note(
            "11111Первая заметка",
            "11111lskdfjlksdfj dslfkjds dsfalkjalsdf sskdfj sdlfkjf sadfljk",
        ),
        Note(
            "222Вторая заметка",
            "222ШЩЩЩШШ ммтмтмдымь ывдтьа зуцоцуцуо ваыиваы9овыа",
        ),
        Note(
            "33Третья заметка",
            "33ждл жлдждл жд лопоп ждлыва  ыолвдаав шуццуш лдлоыва ваыдлоывдло дывлао",
        ),
        Note(
            "44Червертая заметка",
            "ШЩЩЩШШ ммтмтмдымь ывдтьа зуцоцуцуо ваыиваы9овыа",
        ),
        Note(
            "55Пятая заметка",
            "ццууууу жлдждл жд лопоп ждлыва  ыолвдаав шуццуш лдлоыва ваыдлоывдло дывлаоываыав ваыфв фываыва фываы фыв ф вфыавываыф",
            //0xfff06292.toInt(),
            //false
        ),
        Note(
            "66Шестая заметка",
            "ШЩЩЩШШ ммтмтмдымь ывдтьа зуцоцуцуо ваыиваы9овыа",
        ),
        Note(
            "Седьмая заметка",
            "ццууууу жлдждл жд лопоп ждлыва  ыолвдаав шуццуш лдлоыва ваыдлоывдло дывлаоываыав ваыфв фываыва фываы фыв ф вфыавываыф",
        ),
        Note(
            "8888888888 заметка",
            "8888888888ццууууу жлдждл жд лопоп ждлыва  ыолвдаав шуццуш лдлоыва ваыдлоывдло дывлаоываыав ваыфв фываыва фываы фыв ф вфыавываыф",
        ),
        Note(
            "99999Седьмая заметка",
            "99999ццууууу жлдждл жд лопоп ждлыва  ыолвдаав шуццуш лдлоыва ваыдлоывдло дывлаоываыав ваыфв фываыва фываы фыв ф вфыавываыф",
        )



    )

    fun getNotes (): List<Note> {
        return notes
    }
}